app/controllers/api/v1/entries_controller.rb

      def index
        entries = Entry.order('created_at DESC');
---
SELECT "entries".* FROM "entries" ORDER BY "entries"."created_at" DESC, created_at DESC

      def create
        entry = Entry.new(entry_params)
        if entry.save
---
INSERT INTO "entries" ("titulo", "cuerpo", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["titulo", "Testeando"], ["cuerpo", "Sin bajada"], ["created_at", "2018-04-01 03:59:29.679268"], ["updated_at", "2018-04-01 03:59:29.679268"]]

      def destroy
        entry = Entry.find(params[:id])
        entry.destroy
---
SELECT  "entries".* FROM "entries" WHERE "entries"."id" = $1 ORDER BY "entries"."created_at" DESC LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "entries" WHERE "entries"."id" = $1  [["id", 4]]

      def update
        entry = Entry.find(params[:id])
        if entry.update_attributes(entry_params)
---
SELECT  "entries".* FROM "entries" WHERE "entries"."id" = $1 ORDER BY "entries"."created_at" DESC LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "entries" SET "bajada" = $1, "cuerpo" = $2, "updated_at" = $3 WHERE "entries"."id" = $4  [["bajada", "Ahora con bajada"], ["cuerpo", "Si tiene bajada ahora"], ["updated_at", "2018-04-01 04:05:38.023495"], ["id", 3]]