app/controllers/comments_controller.rb

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = $1 ORDER BY "entries"."created_at" DESC LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."entry_id" = $1 ORDER BY created_at DESC  [["entry_id", 3]]
---
  def index
    entry = Entry.find(params[:entry_id])
    comments = entry.comments.order('created_at DESC');

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = $1 ORDER BY "entries"."created_at" DESC LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."entry_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["entry_id", 3], ["id", 1], ["LIMIT", 1]]
---
  def show
    entry = Entry.find(params[:entry_id])
    comment = entry.comments.find(params[:id])

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = $1 ORDER BY "entries"."created_at" DESC LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "comments" ("author", "comment", "entry_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author", "Dendaos"], ["comment", "COmentario pro, muy buena new"], ["entry_id", 3], ["created_at", "2018-04-01 17:48:58.350299"], ["updated_at", "2018-04-01 17:48:58.350299"]]
---
  def create
    entry = Entry.find(params[:entry_id])
    comment = entry.comments.new(comment_params)
    if comment.save

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = $1 ORDER BY "entries"."created_at" DESC LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."entry_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["entry_id", 3], ["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]
---
  def destroy
    entry = Entry.find(params[:entry_id])
    comment = entry.comments.find(params[:id])
    comment.destroy

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = $1 ORDER BY "entries"."created_at" DESC LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."entry_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["entry_id", 3], ["id", 1], ["LIMIT", 1]]
UPDATE "comments" SET "comment" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["comment", "COmentario pro, muy mala new"], ["updated_at", "2018-04-01 17:49:24.593337"], ["id", 1]]
---
  def update
    entry = Entry.find(params[:entry_id])
    comment = entry.comments.find(params[:id])
    if comment.update_attributes(comment_params)