app/controllers/entries_controller.rb

  def index
    entries = Entry.order('created_at DESC');
---
SELECT "entries".* FROM "entries" ORDER BY "entries"."created_at" DESC, created_at DESC

  def show
    entry = Entry.find(params[:id])
---
SELECT  "entries".* FROM "entries" WHERE "entries"."id" = $1 ORDER BY "entries"."created_at" DESC LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def create
    entry = Entry.new(entry_params)
    if entry.save
---
INSERT INTO "entries" ("titulo", "bajada", "cuerpo", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["titulo", "123"], ["bajada", "123"], ["cuerpo", "123"], ["user_id", 2], ["created_at", "2018-03-19 06:44:05.219446"], ["updated_at", "2018-03-19 06:44:05.219446"]]

  def destroy
    entry = Entry.find(params[:id])
    entry.destroy
---
SELECT  "entries".* FROM "entries" WHERE "entries"."id" = $1 ORDER BY "entries"."created_at" DESC LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "entries" WHERE "entries"."id" = $1  [["id", 5]]

  def update
    entry = Entry.find(params[:id])
    if entry.update_attributes(entry_params)
---
SELECT  "entries".* FROM "entries" WHERE "entries"."id" = $1 ORDER BY "entries"."created_at" DESC LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "entries" SET "subtitle" = $1, "updated_at" = $2 WHERE "entries"."id" = $3  [["subtitle", "AHORA TIENESUB"], ["updated_at", "2018-04-01 17:46:22.166879"], ["id", 4]]